Revit 2023 API
TopographySurface.Create Method
Overload List
Name | Description
Create(Document, IList<XYZ>)
 Creates a new topography surface element and adds it to the document.
Create(Document, IList<XYZ>, IList<PolymeshFacet>)
 Creates a new topography surface element from facets and adds it to the document.
See Also
TopographySurface Class
TopographySurface Members
Autodesk.Revit.DB.Architecture Namespace